zephyrproject-rtos/hal_nuvoton/m55m1x/StdDriver/inc/gdma/dma350_regdef.h
#define DMA_NSEC_CTRL_INTREN_ALLCHPAUSED            DMA_NSEC_CTRL_INTREN_ALLCHPAUSED_Msk                      /*!< INTREN_ALLCHPAUSED bit All Non-Secure Channel Paused Interrupt Enable*/
#define DMA_NSEC_CTRL_ALLCHSTOP_Pos                 (8U)
#define DMA_NSEC_CTRL_ALLCHSTOP_Msk                 (0x1UL << DMA_NSEC_CTRL_ALLCHSTOP_Pos)                    /*!< 0x00000100UL*/
#define DMA_NSEC_CTRL_ALLCHSTOP                     DMA_NSEC_CTRL_ALLCHSTOP_Msk                               /*!< ALLCHSTOP bit Non-Secure All Channel Stop Request. When set to '1', all Non-secure channels get a stop request. Stays asserted until the STAT_ALLCHSTOPPED status flag is set. Cleared automatically when the STAT_ALLCHSTOPPED status flag is cleared.*/
#define DMA_NSEC_CTRL_ALLCHPAUSE_Pos                (9U)
#define DMA_NSEC_CTRL_ALLCHPAUSE_Msk                (0x1UL << DMA_NSEC_CTRL_ALLCHPAUSE_Pos)                   /*!< 0x00000200UL*/
#define DMA_NSEC_CTRL_ALLCHPAUSE                    DMA_NSEC_CTRL_ALLCHPAUSE_Msk                              /*!< ALLCHPAUSE bit Non-Secure All Channel Pause Request. When set to '1', all Non-secure channels get a pause request. Stays asserted until the channels are paused and the STAT_ALLCHPAUSED status flag is set. Cleared automatically when the STAT_ALLCHPAUSED status flag is cleared.*/
#define DMA_NSEC_CTRL_DBGHALTNSRO_Pos               (27U)
#define DMA_NSEC_CTRL_DBGHALTNSRO_Msk               (0x1UL << DMA_NSEC_CTRL_DBGHALTNSRO_Pos)                  /*!< 0x08000000UL*/
#define DMA_NSEC_CTRL_DBGHALTNSRO                   DMA_NSEC_CTRL_DBGHALTNSRO_Msk                             /*!< DBGHALTNSRO bit Debug Halt Enable Non-Secure Read Only. When set to '1', the NSEC_CTRL.DBGHALTEN register becomes read-only. When set to '0', NSEC_CTRL.DBGHALTEN has read-write access. This register is read-only for the non-secure SW.*/
#define DMA_NSEC_CTRL_DBGHALTEN_Pos                 (28U)
#define DMA_NSEC_CTRL_DBGHALTEN_Msk                 (0x1UL << DMA_NSEC_CTRL_DBGHALTEN_Pos)                    /*!< 0x10000000UL*/
#define DMA_NSEC_CTRL_DBGHALTEN                     DMA_NSEC_CTRL_DBGHALTEN_Msk                               /*!< DBGHALTEN bit Debug Halt Enabled. When set to '0', the DMA ignores the halt request from an external debugger. Clearing this bit while halt is ongoing results in continuing the operation. When set to '1', the debugger request to halt the DMA is allowed. This field is common for non-secure and secure side of the DMA, but access to this register is limited by the DBGHALTNSRO register field.*/
#define DMA_NSEC_CTRL_IDLERETEN_Pos                 (29U)
#define DMA_NSEC_CTRL_IDLERETEN_Msk                 (0x1UL << DMA_NSEC_CTRL_IDLERETEN_Pos)                    /*!< 0x20000000UL*/
#define DMA_NSEC_CTRL_IDLERETEN                     DMA_NSEC_CTRL_IDLERETEN_Msk                               /*!< IDLERETEN bit Idle Channel Retention Enable. Allows retention for non-secure channels that are enabled and waiting for an event in IDLE state.
 - 0: disabled
 - 1: enabled*/
#define DMA_NSEC_CTRL_DISMINPWR_Pos                 (30U)
#define DMA_NSEC_CTRL_DISMINPWR_Msk                 (0x3UL << DMA_NSEC_CTRL_DISMINPWR_Pos)                    /*!< 0xC0000000UL*/
#define DMA_NSEC_CTRL_DISMINPWR                     DMA_NSEC_CTRL_DISMINPWR_Msk                               /*!< DISMINPWR[ 1:0] bits Minimum Power state of the DMAC when at least one non-secure channel is present.
 - 00: OFF
 - 01: Retention
 - 10: ON
 - Others: Reserved*/
#define DMA_NSEC_CTRL_DISMINPWR_0                   (0x1UL << DMA_NSEC_CTRL_DISMINPWR_Pos)                    /*!< 0x40000000UL*/
#define DMA_NSEC_CTRL_DISMINPWR_1                   (0x2UL << DMA_NSEC_CTRL_DISMINPWR_Pos)                    /*!< 0x80000000UL*/
/****************  Field definitions for NSEC_CHPTR register  *****************/
#define DMA_NSEC_CHPTR_CHPTR_Pos                    (0U)
#define DMA_NSEC_CHPTR_CHPTR_Msk                    (0x3FUL << DMA_NSEC_CHPTR_CHPTR_Pos)                      /*!< 0x0000003FUL*/
#define DMA_NSEC_CHPTR_CHPTR                        DMA_NSEC_CHPTR_CHPTR_Msk                                  /*!< CHPTR[ 5:0] bits Non-Secure Channel Pointer. Selects which channel settings can be adjusted by the following registers.*/
#define DMA_NSEC_CHPTR_CHPTR_0                      (0x1UL << DMA_NSEC_CHPTR_CHPTR_Pos)                       /*!< 0x00000001UL*/
#define DMA_NSEC_CHPTR_CHPTR_1                      (0x2UL << DMA_NSEC_CHPTR_CHPTR_Pos)                       /*!< 0x00000002UL*/
#define DMA_NSEC_CHPTR_CHPTR_2                      (0x4UL << DMA_NSEC_CHPTR_CHPTR_Pos)                       /*!< 0x00000004UL*/
#define DMA_NSEC_CHPTR_CHPTR_3                      (0x8UL << DMA_NSEC_CHPTR_CHPTR_Pos)                       /*!< 0x00000008UL*/
#define DMA_NSEC_CHPTR_CHPTR_4                      (0x10UL << DMA_NSEC_CHPTR_CHPTR_Pos)                      /*!< 0x00000010UL*/
#define DMA_NSEC_CHPTR_CHPTR_5                      (0x20UL << DMA_NSEC_CHPTR_CHPTR_Pos)                      /*!< 0x00000020UL*/
/****************  Field definitions for NSEC_CHCFG register  *****************/
#define DMA_NSEC_CHCFG_CHID_Pos                     (0U)
#define DMA_NSEC_CHCFG_CHID_Msk                     (0xFFFFUL << DMA_NSEC_CHCFG_CHID_Pos)                     /*!< 0x0000FFFFUL*/
#define DMA_NSEC_CHCFG_CHID                         DMA_NSEC_CHCFG_CHID_Msk                                   /*!< CHID[15:0] bits Non-Secure Channel ID value. NSECCHPTR selects the channel ID value to be read or written via this register. CHID_WIDTH limits this field, unused bits are RAZWI.*/
#define DMA_NSEC_CHCFG_CHIDVLD_Pos                  (16U)
#define DMA_NSEC_CHCFG_CHIDVLD_Msk                  (0x1UL << DMA_NSEC_CHCFG_CHIDVLD_Pos)                     /*!< 0x00010000UL*/
#define DMA_NSEC_CHCFG_CHIDVLD                      DMA_NSEC_CHCFG_CHIDVLD_Msk                                /*!< CHIDVLD bit Non-Secure Channel ID valid. NSECCHPTR selects the channel. Set to '1' to drive the channel ID value in CHID for all the transfers by the selected channel.*/
#define DMA_NSEC_CHCFG_CHPRIV_Pos                   (17U)
#define DMA_NSEC_CHCFG_CHPRIV_Msk                   (0x1UL << DMA_NSEC_CHCFG_CHPRIV_Pos)                      /*!< 0x00020000UL*/
#define DMA_NSEC_CHCFG_CHPRIV                       DMA_NSEC_CHCFG_CHPRIV_Msk                                 /*!< CHPRIV bit Non-Secure Channel Privilege Enable. NSECCHPTR selects the channel. When set to '1' it allows the channel to send transfers marked as Privileged only. The configuration registers of the selected channel are also given privileged only access rights. When set to '0' the channel is only allowed to send unprivileged transfers and the channel registers can be accessed by both privileged and unprivileged register accesses.*/
/**************  Field definitions for NSEC_STATUSPTR register  ***************/
#define DMA_NSEC_STATUSPTR_NSECSTATUSPTR_Pos        (0U)
#define DMA_NSEC_STATUSPTR_NSECSTATUSPTR_Msk        (0xFUL << DMA_NSEC_STATUSPTR_NSECSTATUSPTR_Pos)           /*!< 0x0000000FUL*/
#define DMA_NSEC_STATUSPTR_NSECSTATUSPTR            DMA_NSEC_STATUSPTR_NSECSTATUSPTR_Msk                      /*!< NSECSTATUSPTR[ 3:0] bits Non-Secure DMA Unit status pointer used to select which status value to view using STATUSVALUE register. Pointer values are:
 - 0: Channel Enabled Status for channel numbers [31 : 0].
 - 1: Reserved
 - 2: Channel Stopped Status for channel numbers [31 : 0].
 - 3: Reserved
 - 4: Channel Paused Status for channel numbers [31 : 0].
 - Others: Reserved.*/
#define DMA_NSEC_STATUSPTR_NSECSTATUSPTR_0          (0x1UL << DMA_NSEC_STATUSPTR_NSECSTATUSPTR_Pos)           /*!< 0x00000001UL*/
#define DMA_NSEC_STATUSPTR_NSECSTATUSPTR_1          (0x2UL << DMA_NSEC_STATUSPTR_NSECSTATUSPTR_Pos)           /*!< 0x00000002UL*/
#define DMA_NSEC_STATUSPTR_NSECSTATUSPTR_2          (0x4UL << DMA_NSEC_STATUSPTR_NSECSTATUSPTR_Pos)           /*!< 0x00000004UL*/
#define DMA_NSEC_STATUSPTR_NSECSTATUSPTR_3          (0x8UL << DMA_NSEC_STATUSPTR_NSECSTATUSPTR_Pos)           /*!< 0x00000008UL*/
/**************  Field definitions for NSEC_STATUSVAL register  ***************/
#define DMA_NSEC_STATUSVAL_NSECSTATUSVAL_Pos        (0U)
#define DMA_NSEC_STATUSVAL_NSECSTATUSVAL_Msk        (0xFFFFFFFFUL << DMA_NSEC_STATUSVAL_NSECSTATUSVAL_Pos)    /*!< 0xFFFFFFFFUL*/
#define DMA_NSEC_STATUSVAL_NSECSTATUSVAL            DMA_NSEC_STATUSVAL_NSECSTATUSVAL_Msk                      /*!< NSECSTATUSVAL[31:0] bits Non-Secure DMA Unit status value. Can be used for reading internal status values of the DMA Unit for debug purposes. Values shown here are dependent on STATUSPTR. Note that inputs are masked by security mapping before being presented here. This means that only status values mapped to Non-secure world are visible as non-Zero values.
All unimplemented bits are RAZWI. */
/**************  Field definitions for NSEC_SIGNALPTR register  ***************/
#define DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_Pos        (0U)
#define DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_Msk        (0xFUL << DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_Pos)           /*!< 0x0000000FUL*/
#define DMA_NSEC_SIGNALPTR_NSECSIGNALPTR            DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_Msk                      /*!< NSECSIGNALPTR[ 3:0] bits Non-Secure DMA Unit signal pointer used to select which inputs or outputs to view using SIGNALVAL register. Pointer values, x,  are:
 - 0 to 7: Trigger Input Requests [31+32*x : 32*x]
 - 8 to 9: Trigger output Acknowledges [31+32*(x-8) :  32*(x-8)]
 - 10 to 11: GPO output value [31+32*(x-10) : 32*(x-10)], only present when HAS_GPOSEL is set
 - Others: Reserved*/
#define DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_0          (0x1UL << DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_Pos)           /*!< 0x00000001UL*/
#define DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_1          (0x2UL << DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_Pos)           /*!< 0x00000002UL*/
#define DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_2          (0x4UL << DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_Pos)           /*!< 0x00000004UL*/
#define DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_3          (0x8UL << DMA_NSEC_SIGNALPTR_NSECSIGNALPTR_Pos)           /*!< 0x00000008UL*/
/**************  Field definitions for NSEC_SIGNALVAL register  ***************/
#define DMA_NSEC_SIGNALVAL_NSECSIGNALVAL_Pos        (0U)
#define DMA_NSEC_SIGNALVAL_NSECSIGNALVAL_Msk        (0xFFFFFFFFUL << DMA_NSEC_SIGNALVAL_NSECSIGNALVAL_Pos)    /*!< 0xFFFFFFFFUL*/
#define DMA_NSEC_SIGNALVAL_NSECSIGNALVAL            DMA_NSEC_SIGNALVAL_NSECSIGNALVAL_Msk                      /*!< NSECSIGNALVAL[31:0] bits Non-Secure DMA Unit signal status. Can be used for reading signal values of triggers and GPOs for debug. Values shown here are dependent on SIGNALPTR. Note that inputs are masked by security mapping before being presented here. This means that only signals mapped to Non-secure world are visible as non-zero values. Writing to this register has the following effect:
 - Writing '1' to a Non-secure Trigger Input Request that are not selected by any DMA channel will cause a deny response for it. This can attempt to clear an unwanted trigger input.
 - Writing '1' to any Trigger Output Acknowledges status, GPO status and all Trigger Input Request already selected by any DMA channel is ignored.
All unimplemented bits are RAZWI. */
/******************************************************************************/
/*                                 DMASECCTRL                                 */
/******************************************************************************/
/*************  Field definitions for SEC_CHINTRSTATUS0 register  *************/
#define DMA_SEC_CHINTRSTATUS0_CHINTRSTATUS0_Pos     (0U)
#define DMA_SEC_CHINTRSTATUS0_CHINTRSTATUS0_Msk     (0xFFFFFFFFUL << DMA_SEC_CHINTRSTATUS0_CHINTRSTATUS0_Pos) /*!< 0xFFFFFFFFUL*/
#define DMA_SEC_CHINTRSTATUS0_CHINTRSTATUS0         DMA_SEC_CHINTRSTATUS0_CHINTRSTATUS0_Msk                   /*!< CHINTRSTATUS0[31:0] bits Collated Secure Channel Interrupt flags for channel 0 to Channel 31. Limited by NUM_CHANNELS, all unimplemented bits are reserved.*/
/****************  Field definitions for SEC_STATUS register  *****************/
#define DMA_SEC_STATUS_INTR_ANYCHINTR_Pos           (0U)
#define DMA_SEC_STATUS_INTR_ANYCHINTR_Msk           (0x1UL << DMA_SEC_STATUS_INTR_ANYCHINTR_Pos)              /*!< 0x00000001UL*/
#define DMA_SEC_STATUS_INTR_ANYCHINTR               DMA_SEC_STATUS_INTR_ANYCHINTR_Msk                         /*!< INTR_ANYCHINTR bit Combined Secure Channel Interrupt Flag.  Set to '1' when any Secure channel has an interrupt request in CHINTRSTATUS0 and SECCTRL.INTREN_ANYCHINTR = 1. Cleared automatically when the source of the channel interrupt is cleared.*/
#define DMA_SEC_STATUS_INTR_ALLCHIDLE_Pos           (1U)
#define DMA_SEC_STATUS_INTR_ALLCHIDLE_Msk           (0x1UL << DMA_SEC_STATUS_INTR_ALLCHIDLE_Pos)              /*!< 0x00000002UL*/
#define DMA_SEC_STATUS_INTR_ALLCHIDLE               DMA_SEC_STATUS_INTR_ALLCHIDLE_Msk                         /*!< INTR_ALLCHIDLE bit All Secure Channel Idle Interrupt Status. Set to '1' when SECCTRL.STAT_ALLCHIDLE is asserted and SECCTRL.INTREN_ALLCHIDLE = 1. Cleared automatically when STAT_ALLCHIDLE is cleared.*/
#define DMA_SEC_STATUS_INTR_ALLCHSTOPPED_Pos        (2U)
#define DMA_SEC_STATUS_INTR_ALLCHSTOPPED_Msk        (0x1UL << DMA_SEC_STATUS_INTR_ALLCHSTOPPED_Pos)           /*!< 0x00000004UL*/
#define DMA_SEC_STATUS_INTR_ALLCHSTOPPED            DMA_SEC_STATUS_INTR_ALLCHSTOPPED_Msk                      /*!< INTR_ALLCHSTOPPED bit All Secure Channel Stopped Interrupt Status. Set to '1' when SECCTRL.STAT_ALLCHSTOPPED is asserted and SECCTRL.INTREN_ALLCHSTOPPED = 1. Cleared automatically when STAT_ALLCHSTOPPED is cleared.*/
#define DMA_SEC_STATUS_INTR_ALLCHPAUSED_Pos         (3U)
#define DMA_SEC_STATUS_INTR_ALLCHPAUSED_Msk         (0x1UL << DMA_SEC_STATUS_INTR_ALLCHPAUSED_Pos)            /*!< 0x00000008UL*/
#define DMA_SEC_STATUS_INTR_ALLCHPAUSED             DMA_SEC_STATUS_INTR_ALLCHPAUSED_Msk                       /*!< INTR_ALLCHPAUSED bit All Secure Channel Paused Interrupt Status. Set to '1' when SECCTRL.STAT_ALLCHPAUSED is asserted and SECCTRL.INTREN_ALLCHPAUSED = 1. Cleared automatically when STAT_ALLCHPAUSED is cleared.*/
#define DMA_SEC_STATUS_STAT_ALLCHIDLE_Pos           (17U)
#define DMA_SEC_STATUS_STAT_ALLCHIDLE_Msk           (0x1UL << DMA_SEC_STATUS_STAT_ALLCHIDLE_Pos)              /*!< 0x00020000UL*/
#define DMA_SEC_STATUS_STAT_ALLCHIDLE               DMA_SEC_STATUS_STAT_ALLCHIDLE_Msk                         /*!< STAT_ALLCHIDLE bit All Secure Channel Idle Status. Set to '1' whenever all Secure DMA channel is in idle state after at least one channel was running. Cleared by writing '1' to this bit.*/
#define DMA_SEC_STATUS_STAT_ALLCHSTOPPED_Pos        (18U)
#define DMA_SEC_STATUS_STAT_ALLCHSTOPPED_Msk        (0x1UL << DMA_SEC_STATUS_STAT_ALLCHSTOPPED_Pos)           /*!< 0x00040000UL*/
#define DMA_SEC_STATUS_STAT_ALLCHSTOPPED            DMA_SEC_STATUS_STAT_ALLCHSTOPPED_Msk                      /*!< STAT_ALLCHSTOPPED bit All Secure Channel Stopped Status. Set to '1' whenever all Secure DMA channels are in stopped or inactive state and the ALLCHSTOP request is active. Not set when channels reach the stopped state for other reasons. All Secure channels are forced to an immediate stopped state until ALLCHSTOP request is asserted even if they were enabled after the request. Cleared by writing '1' to this bit. The ALLCHSTOP request is also cleared when this bit is cleared.*/
#define DMA_SEC_STATUS_STAT_ALLCHPAUSED_Pos         (19U)
#define DMA_SEC_STATUS_STAT_ALLCHPAUSED_Msk         (0x1UL << DMA_SEC_STATUS_STAT_ALLCHPAUSED_Pos)            /*!< 0x00080000UL*/
#define DMA_SEC_STATUS_STAT_ALLCHPAUSED             DMA_SEC_STATUS_STAT_ALLCHPAUSED_Msk                       /*!< STAT_ALLCHPAUSED bit All Secure Channel Paused Status. Set to '1' whenever all Secure DMA channel is in paused or inactive state and the ALLCHPAUSE request is active. Not set when channels reach the paused state for other reasons. All Secure channels are forced to an immediate pause until ALLCHPAUSE request is asserted even if they were enabled after the request. Cleared by writing '1' to this bit which results in all secure channels to resume their operation. The ALLCHPAUSE request is also cleared when this bit is cleared.*/
/*****************  Field definitions for SEC_CTRL register  ******************/
#define DMA_SEC_CTRL_INTREN_ANYCHINTR_Pos           (0U)
#define DMA_SEC_CTRL_INTREN_ANYCHINTR_Msk           (0x1UL << DMA_SEC_CTRL_INTREN_ANYCHINTR_Pos)              /*!< 0x00000001UL*/
#define DMA_SEC_CTRL_INTREN_ANYCHINTR               DMA_SEC_CTRL_INTREN_ANYCHINTR_Msk                         /*!< INTREN_ANYCHINTR bit Combined Secure Channel Interrupt Enable*/
#define DMA_SEC_CTRL_INTREN_ALLCHIDLE_Pos           (1U)
#define DMA_SEC_CTRL_INTREN_ALLCHIDLE_Msk           (0x1UL << DMA_SEC_CTRL_INTREN_ALLCHIDLE_Pos)              /*!< 0x00000002UL*/
#define DMA_SEC_CTRL_INTREN_ALLCHIDLE               DMA_SEC_CTRL_INTREN_ALLCHIDLE_Msk                         /*!< INTREN_ALLCHIDLE bit All Secure Channel Idle Interrupt Enable*/
#define DMA_SEC_CTRL_INTREN_ALLCHSTOPPED_Pos        (2U)
#define DMA_SEC_CTRL_INTREN_ALLCHSTOPPED_Msk        (0x1UL << DMA_SEC_CTRL_INTREN_ALLCHSTOPPED_Pos)           /*!< 0x00000004UL*/
#define DMA_SEC_CTRL_INTREN_ALLCHSTOPPED            DMA_SEC_CTRL_INTREN_ALLCHSTOPPED_Msk                      /*!< INTREN_ALLCHSTOPPED bit All Secure Channels Stopped Interrupt Enable*/
#define DMA_SEC_CTRL_INTREN_ALLCHPAUSED_Pos         (3U)
#define DMA_SEC_CTRL_INTREN_ALLCHPAUSED_Msk         (0x1UL << DMA_SEC_CTRL_INTREN_ALLCHPAUSED_Pos)            /*!< 0x00000008UL*/
#define DMA_SEC_CTRL_INTREN_ALLCHPAUSED             DMA_SEC_CTRL_INTREN_ALLCHPAUSED_Msk                       /*!< INTREN_ALLCHPAUSED bit All Secure Channel Paused Interrupt Enable*/
#define DMA_SEC_CTRL_ALLCHSTOP_Pos                  (8U)
#define DMA_SEC_CTRL_ALLCHSTOP_Msk                  (0x1UL << DMA_SEC_CTRL_ALLCHSTOP_Pos)                     /*!< 0x00000100UL*/
#define DMA_SEC_CTRL_ALLCHSTOP                      DMA_SEC_CTRL_ALLCHSTOP_Msk                                /*!< ALLCHSTOP bit Secure All Channel Stop Request. When set to '1', all Secure channels get a stop request. Stays asserted until the STAT_ALLCHSTOPPED status flag is set. Cleared automatically when the STAT_ALLCHSTOPPED status flag is cleared.*/
#define DMA_SEC_CTRL_ALLCHPAUSE_Pos                 (9U)
#define DMA_SEC_CTRL_ALLCHPAUSE_Msk                 (0x1UL << DMA_SEC_CTRL_ALLCHPAUSE_Pos)                    /*!< 0x00000200UL*/
#define DMA_SEC_CTRL_ALLCHPAUSE                     DMA_SEC_CTRL_ALLCHPAUSE_Msk                               /*!< ALLCHPAUSE bit Secure All Channel Pause Request. When set to '1', all Secure channels get a pause request. Stays asserted until the channels are paused and the STAT_ALLCHPAUSED status flag is set. Cleared automatically when the STAT_ALLCHPAUSED status flag is cleared.*/
#define DMA_SEC_CTRL_DBGHALTNSRO_Pos                (27U)
#define DMA_SEC_CTRL_DBGHALTNSRO_Msk                (0x1UL << DMA_SEC_CTRL_DBGHALTNSRO_Pos)                   /*!< 0x08000000UL*/
#define DMA_SEC_CTRL_DBGHALTNSRO                    DMA_SEC_CTRL_DBGHALTNSRO_Msk                              /*!< DBGHALTNSRO bit Debug Halt Enable Non-Secure Read Only. When set to '1', the NSEC_CTRL.DBGHALTEN register becomes read-only. When set to '0', NSEC_CTRL.DBGHALTEN has read-write access. This register allows the secure SW to limit the non-secure SW adjusting the common DBGHALTEN register bit.*/
#define DMA_SEC_CTRL_DBGHALTEN_Pos                  (28U)
#define DMA_SEC_CTRL_DBGHALTEN_Msk                  (0x1UL << DMA_SEC_CTRL_DBGHALTEN_Pos)                     /*!< 0x10000000UL*/
#define DMA_SEC_CTRL_DBGHALTEN                      DMA_SEC_CTRL_DBGHALTEN_Msk                                /*!< DBGHALTEN bit Debug Halt Enabled. When set to '0', the DMA ignores the halt request from an external debugger. Clearing this bit while halt is ongoing results in continuing the operation. When set to '1', the debugger request to halt the DMA is allowed for all channels. This field is common for non-secure and secure side of the DMA, but control can be limited by the SEC_CTRL.DBGHALTNSRO register field.*/
#define DMA_SEC_CTRL_IDLERETEN_Pos                  (29U)
#define DMA_SEC_CTRL_IDLERETEN_Msk                  (0x1UL << DMA_SEC_CTRL_IDLERETEN_Pos)                     /*!< 0x20000000UL*/
#define DMA_SEC_CTRL_IDLERETEN                      DMA_SEC_CTRL_IDLERETEN_Msk                                /*!< IDLERETEN bit Idle Channel Retention Enable. Allows retention for Secure channels that are enabled and waiting for an event in IDLE state.
 - 0: disabled
 - 1: enabled*/
#define DMA_SEC_CTRL_DISMINPWR_Pos                  (30U)
#define DMA_SEC_CTRL_DISMINPWR_Msk                  (0x3UL << DMA_SEC_CTRL_DISMINPWR_Pos)                     /*!< 0xC0000000UL*/
#define DMA_SEC_CTRL_DISMINPWR                      DMA_SEC_CTRL_DISMINPWR_Msk                                /*!< DISMINPWR[ 1:0] bits Minimum Power state of the DMAC when at least one secure channel is present.
 - 00: OFF
 - 01: Retention
 - 10: ON
 - Others: Reserved*/
#define DMA_SEC_CTRL_DISMINPWR_0                    (0x1UL << DMA_SEC_CTRL_DISMINPWR_Pos)                     /*!< 0x40000000UL*/
#define DMA_SEC_CTRL_DISMINPWR_1                    (0x2UL << DMA_SEC_CTRL_DISMINPWR_Pos)                     /*!< 0x80000000UL*/
/*****************  Field definitions for SEC_CHPTR register  *****************/
#define DMA_SEC_CHPTR_CHPTR_Pos                     (0U)
#define DMA_SEC_CHPTR_CHPTR_Msk                     (0x3FUL << DMA_SEC_CHPTR_CHPTR_Pos)                       /*!< 0x0000003FUL*/
#define DMA_SEC_CHPTR_CHPTR                         DMA_SEC_CHPTR_CHPTR_Msk                                   /*!< CHPTR[ 5:0] bits Secure Channel Pointer. Selects which channel settings can be adjusted by the following registers.*/
#define DMA_SEC_CHPTR_CHPTR_0                       (0x1UL << DMA_SEC_CHPTR_CHPTR_Pos)                        /*!< 0x00000001UL*/
#define DMA_SEC_CHPTR_CHPTR_1                       (0x2UL << DMA_SEC_CHPTR_CHPTR_Pos)                        /*!< 0x00000002UL*/
#define DMA_SEC_CHPTR_CHPTR_2                       (0x4UL << DMA_SEC_CHPTR_CHPTR_Pos)                        /*!< 0x00000004UL*/
#define DMA_SEC_CHPTR_CHPTR_3                       (0x8UL << DMA_SEC_CHPTR_CHPTR_Pos)                        /*!< 0x00000008UL*/
#define DMA_SEC_CHPTR_CHPTR_4                       (0x10UL << DMA_SEC_CHPTR_CHPTR_Pos)                       /*!< 0x00000010UL*/
#define DMA_SEC_CHPTR_CHPTR_5                       (0x20UL << DMA_SEC_CHPTR_CHPTR_Pos)                       /*!< 0x00000020UL*/
/*****************  Field definitions for SEC_CHCFG register  *****************/
#define DMA_SEC_CHCFG_CHID_Pos                      (0U)
#define DMA_SEC_CHCFG_CHID_Msk                      (0xFFFFUL << DMA_SEC_CHCFG_CHID_Pos)                      /*!< 0x0000FFFFUL*/
#define DMA_SEC_CHCFG_CHID                          DMA_SEC_CHCFG_CHID_Msk                                    /*!< CHID[15:0] bits Secure Channel ID value. SECCHPTR selects the channel ID value to be read or written via this register. CHID_WIDTH limits this field, unused bits are RAZWI.*/
#define DMA_SEC_CHCFG_CHIDVLD_Pos                   (16U)
#define DMA_SEC_CHCFG_CHIDVLD_Msk                   (0x1UL << DMA_SEC_CHCFG_CHIDVLD_Pos)                      /*!< 0x00010000UL*/
#define DMA_SEC_CHCFG_CHIDVLD                       DMA_SEC_CHCFG_CHIDVLD_Msk                                 /*!< CHIDVLD bit Secure Channel ID valid. SECCHPTR selects the channel. Set to '1' to drive the channel ID value in CHID for all the transfers by the selected channel.*/
#define DMA_SEC_CHCFG_CHPRIV_Pos                    (17U)
