zephyrproject-rtos/hal_nuvoton/m55m1x/StdDriver/inc/gdma/dma350_regdef.h
#define DMA_SEC_CHCFG_CHPRIV_Msk                    (0x1UL << DMA_SEC_CHCFG_CHPRIV_Pos)                       /*!< 0x00020000UL*/
#define DMA_SEC_CHCFG_CHPRIV                        DMA_SEC_CHCFG_CHPRIV_Msk                                  /*!< CHPRIV bit Secure Channel Privilege Enable. SECCHPTR selects the channel. When set to '1' it allows the channel to send transfers marked as Privileged only. The configuration registers of the selected channel are also given privileged only access rights. When set to '0' the channel is only allowed to send unprivileged transfers and the channel registers can be accessed by both privileged and unprivileged register accesses.*/
/***************  Field definitions for SEC_STATUSPTR register  ***************/
#define DMA_SEC_STATUSPTR_SECSTATUSPTR_Pos          (0U)
#define DMA_SEC_STATUSPTR_SECSTATUSPTR_Msk          (0xFUL << DMA_SEC_STATUSPTR_SECSTATUSPTR_Pos)             /*!< 0x0000000FUL*/
#define DMA_SEC_STATUSPTR_SECSTATUSPTR              DMA_SEC_STATUSPTR_SECSTATUSPTR_Msk                        /*!< SECSTATUSPTR[ 3:0] bits Secure DMA Unit status pointer used to select which status value to view using STATUSVALUE register. Pointer values are:
 - 0: Channel Enabled Status for channel numbers [31 : 0].
 - 1: Reserved
 - 2: Channel Stopped Status for channel numbers [31 : 0].
 - 3: Reserved
 - 4: Channel Paused Status for channel numbers [31 : 0].
 - Others: Reserved.*/
#define DMA_SEC_STATUSPTR_SECSTATUSPTR_0            (0x1UL << DMA_SEC_STATUSPTR_SECSTATUSPTR_Pos)             /*!< 0x00000001UL*/
#define DMA_SEC_STATUSPTR_SECSTATUSPTR_1            (0x2UL << DMA_SEC_STATUSPTR_SECSTATUSPTR_Pos)             /*!< 0x00000002UL*/
#define DMA_SEC_STATUSPTR_SECSTATUSPTR_2            (0x4UL << DMA_SEC_STATUSPTR_SECSTATUSPTR_Pos)             /*!< 0x00000004UL*/
#define DMA_SEC_STATUSPTR_SECSTATUSPTR_3            (0x8UL << DMA_SEC_STATUSPTR_SECSTATUSPTR_Pos)             /*!< 0x00000008UL*/
/***************  Field definitions for SEC_STATUSVAL register  ***************/
#define DMA_SEC_STATUSVAL_SECSTATUSVAL_Pos          (0U)
#define DMA_SEC_STATUSVAL_SECSTATUSVAL_Msk          (0xFFFFFFFFUL << DMA_SEC_STATUSVAL_SECSTATUSVAL_Pos)      /*!< 0xFFFFFFFFUL*/
#define DMA_SEC_STATUSVAL_SECSTATUSVAL              DMA_SEC_STATUSVAL_SECSTATUSVAL_Msk                        /*!< SECSTATUSVAL[31:0] bits Secure DMA Unit status value. Can be used for reading internal status values of the DMA Unit for debug purposes. Values shown here are dependent on STATUSPTR. Note that inputs are masked by security mapping before being presented here. This means that only status values mapped to Secure world are visible as non-Zero values.
All unimplemented bits are RAZWI. */
/***************  Field definitions for SEC_SIGNALPTR register  ***************/
#define DMA_SEC_SIGNALPTR_SECSIGNALPTR_Pos          (0U)
#define DMA_SEC_SIGNALPTR_SECSIGNALPTR_Msk          (0xFUL << DMA_SEC_SIGNALPTR_SECSIGNALPTR_Pos)             /*!< 0x0000000FUL*/
#define DMA_SEC_SIGNALPTR_SECSIGNALPTR              DMA_SEC_SIGNALPTR_SECSIGNALPTR_Msk                        /*!< SECSIGNALPTR[ 3:0] bits Secure DMA Unit signal pointer used to select which inputs to view using SIGNALVAL register. Pointer values, x,  are:
 - 0 to 7: Trigger Input Requests [31+32*x : 32*x]
 - 8 to 9: Trigger output Acknowledges [31+32*(x-8) :  32*(x-8)]
 - 10 to 11: GPO output value [31+32*(x-10) : 32*(x-10)], only present when HAS_GPOSEL is set.
 - Others: Reserved*/
#define DMA_SEC_SIGNALPTR_SECSIGNALPTR_0            (0x1UL << DMA_SEC_SIGNALPTR_SECSIGNALPTR_Pos)             /*!< 0x00000001UL*/
#define DMA_SEC_SIGNALPTR_SECSIGNALPTR_1            (0x2UL << DMA_SEC_SIGNALPTR_SECSIGNALPTR_Pos)             /*!< 0x00000002UL*/
#define DMA_SEC_SIGNALPTR_SECSIGNALPTR_2            (0x4UL << DMA_SEC_SIGNALPTR_SECSIGNALPTR_Pos)             /*!< 0x00000004UL*/
#define DMA_SEC_SIGNALPTR_SECSIGNALPTR_3            (0x8UL << DMA_SEC_SIGNALPTR_SECSIGNALPTR_Pos)             /*!< 0x00000008UL*/
/***************  Field definitions for SEC_SIGNALVAL register  ***************/
#define DMA_SEC_SIGNALVAL_SECSIGNALVAL_Pos          (0U)
#define DMA_SEC_SIGNALVAL_SECSIGNALVAL_Msk          (0xFFFFFFFFUL << DMA_SEC_SIGNALVAL_SECSIGNALVAL_Pos)      /*!< 0xFFFFFFFFUL*/
#define DMA_SEC_SIGNALVAL_SECSIGNALVAL              DMA_SEC_SIGNALVAL_SECSIGNALVAL_Msk                        /*!< SECSIGNALVAL[31:0] bits Secure DMA Unit signal status. Can be used for reading signal values of triggers and GPOs for debug. Values shown here are dependent on SIGNALPTR. Note that inputs are masked by security mapping before being presented here. This means that only signal values mapped to Secure world are visible as non-zero values. Writing to this register has the following effect:
 - Writing '1' to a Trigger Input Request that are not selected by any DMA channel will cause a deny response for it. This can attempt to clear an unwanted trigger input.
 - Writing '1' to any Trigger Output Acknowledges status, GPO value and all Trigger Input Request selected by any DMA channel is ignored.
All unimplemented bits are RAZWI. */
/******************************************************************************/
/*                                 DMASECCFG                                  */
/******************************************************************************/
/****************  Field definitions for SCFG_CHSEC0 register  ****************/
#define DMA_SCFG_CHSEC0_SCFGCHSEC0_Pos              (0U)
#define DMA_SCFG_CHSEC0_SCFGCHSEC0_Msk              (0xFFFFFFFFUL << DMA_SCFG_CHSEC0_SCFGCHSEC0_Pos)          /*!< 0xFFFFFFFFUL*/
#define DMA_SCFG_CHSEC0_SCFGCHSEC0                  DMA_SCFG_CHSEC0_SCFGCHSEC0_Msk                            /*!< SCFGCHSEC0[31:0] bits Secure Configuration Channel Security Mapping for Channel 0 to 31. When [i] set to '1', CH<i> is Non-secure world, else Secure world. The NUM_CHANNELS parameter limits this field, unused bits are RAZWI. Value for bit[i] can only be changed if the selected channel is not enabled, so reading back the register content is needed to check the success of the change.*/
/**************  Field definitions for SCFG_TRIGINSEC0 register  **************/
#define DMA_SCFG_TRIGINSEC0_SCFGTRIGINSEC0_Pos      (0U)
#define DMA_SCFG_TRIGINSEC0_SCFGTRIGINSEC0_Msk      (0xFFFFFFFFUL << DMA_SCFG_TRIGINSEC0_SCFGTRIGINSEC0_Pos)  /*!< 0xFFFFFFFFUL*/
#define DMA_SCFG_TRIGINSEC0_SCFGTRIGINSEC0          DMA_SCFG_TRIGINSEC0_SCFGTRIGINSEC0_Msk                    /*!< SCFGTRIGINSEC0[31:0] bits Secure Configuration Tigger Input Security Mapping. When [i] set to '1', Trigger Input <i> is Non-secure world, else Secure world. The NUM_TRIGGER_IN parameter limits this field, unused bits are RAZWI. Value for bit[i] can only be changed if the trigger input port is not in use, so reading back the register content is needed to check the success of the change.*/
/*************  Field definitions for SCFG_TRIGOUTSEC0 register  **************/
#define DMA_SCFG_TRIGOUTSEC0_SCFGTRIGOUTSEC0_Pos    (0U)
#define DMA_SCFG_TRIGOUTSEC0_SCFGTRIGOUTSEC0_Msk    (0xFFFFFFFFUL << DMA_SCFG_TRIGOUTSEC0_SCFGTRIGOUTSEC0_Pos)/*!< 0xFFFFFFFFUL*/
#define DMA_SCFG_TRIGOUTSEC0_SCFGTRIGOUTSEC0        DMA_SCFG_TRIGOUTSEC0_SCFGTRIGOUTSEC0_Msk                  /*!< SCFGTRIGOUTSEC0[31:0] bits Secure Configuration Tigger Output Security Mapping. When [i] set to '1', Trigger Output <i> is Non-secure world, else Secure world. The NUM_TRIGGER_OUT parameter limits this field, unused bits are RAZWI. Value for bit[i] can only be changed if the trigger output port is not in use, so reading back the register content is needed to check the success of the change.*/
/*****************  Field definitions for SCFG_CTRL register  *****************/
#define DMA_SCFG_CTRL_INTREN_SECACCVIO_Pos          (0U)
#define DMA_SCFG_CTRL_INTREN_SECACCVIO_Msk          (0x1UL << DMA_SCFG_CTRL_INTREN_SECACCVIO_Pos)             /*!< 0x00000001UL*/
#define DMA_SCFG_CTRL_INTREN_SECACCVIO              DMA_SCFG_CTRL_INTREN_SECACCVIO_Msk                        /*!< INTREN_SECACCVIO bit Secure Access Violation Interrupt Enable.
 - 0: no interrupt
 - 1: interrupt raised for security violation.*/
#define DMA_SCFG_CTRL_RSPTYPE_SECACCVIO_Pos         (1U)
#define DMA_SCFG_CTRL_RSPTYPE_SECACCVIO_Msk         (0x1UL << DMA_SCFG_CTRL_RSPTYPE_SECACCVIO_Pos)            /*!< 0x00000002UL*/
#define DMA_SCFG_CTRL_RSPTYPE_SECACCVIO             DMA_SCFG_CTRL_RSPTYPE_SECACCVIO_Msk                       /*!< RSPTYPE_SECACCVIO bit Secure Access Violation response type configuration.
 - 0: RAZWI
 - 1: bus error.*/
#define DMA_SCFG_CTRL_SEC_CFG_LCK_Pos               (31U)
#define DMA_SCFG_CTRL_SEC_CFG_LCK_Msk               (0x1UL << DMA_SCFG_CTRL_SEC_CFG_LCK_Pos)                  /*!< 0x80000000UL*/
#define DMA_SCFG_CTRL_SEC_CFG_LCK                   DMA_SCFG_CTRL_SEC_CFG_LCK_Msk                             /*!< SEC_CFG_LCK bit Security Configuration Lock. When set to '1', only SCFG.STAT_SECACCVIO can be cleared, all other register fields in the this block become read-only. Once set to '1', this field can only be set back to '0' by reset.*/
/**************  Field definitions for SCFG_INTRSTATUS register  **************/
#define DMA_SCFG_INTRSTATUS_INTR_SECACCVIO_Pos      (0U)
#define DMA_SCFG_INTRSTATUS_INTR_SECACCVIO_Msk      (0x1UL << DMA_SCFG_INTRSTATUS_INTR_SECACCVIO_Pos)         /*!< 0x00000001UL*/
#define DMA_SCFG_INTRSTATUS_INTR_SECACCVIO          DMA_SCFG_INTRSTATUS_INTR_SECACCVIO_Msk                    /*!< INTR_SECACCVIO bit Secure Access Violation Interrupt Status. Set to '1' when SCFG.STAT_SECACCVIO is asserted and SCFG.INTREN_SECACCVIO = 1. Cleared automatically when STAT_SECACCVIO is cleared.*/
#define DMA_SCFG_INTRSTATUS_STAT_SECACCVIO_Pos      (16U)
#define DMA_SCFG_INTRSTATUS_STAT_SECACCVIO_Msk      (0x1UL << DMA_SCFG_INTRSTATUS_STAT_SECACCVIO_Pos)         /*!< 0x00010000UL*/
#define DMA_SCFG_INTRSTATUS_STAT_SECACCVIO          DMA_SCFG_INTRSTATUS_STAT_SECACCVIO_Msk                    /*!< STAT_SECACCVIO bit Secure Access Violation Status. Set to '1' when a security violation occurred. Write '1' to clear.*/
/******************************************************************************/
/*                                  DMAINFO                                   */
/******************************************************************************/
/***************  Field definitions for DMA_BUILDCFG0 register  ***************/
#define DMA_DMA_BUILDCFG0_FRAMETYPE_Pos             (0U)
#define DMA_DMA_BUILDCFG0_FRAMETYPE_Msk             (0x7UL << DMA_DMA_BUILDCFG0_FRAMETYPE_Pos)                /*!< 0x00000007UL*/
#define DMA_DMA_BUILDCFG0_FRAMETYPE                 DMA_DMA_BUILDCFG0_FRAMETYPE_Msk                           /*!< FRAMETYPE[ 2:0] bits Register Frame Type.
 - 000: Combined Frame,
 - 001: Security Configuration Frame,
 - 010: Secure Control Frame, or if TrustZone not implemented, Control Frame.
 - 011: Non-Secure Control Frame,
 - 100: DMA Channel Frame.
Note that each frame replicates the Information fields.*/
#define DMA_DMA_BUILDCFG0_FRAMETYPE_0               (0x1UL << DMA_DMA_BUILDCFG0_FRAMETYPE_Pos)                /*!< 0x00000001UL*/
#define DMA_DMA_BUILDCFG0_FRAMETYPE_1               (0x2UL << DMA_DMA_BUILDCFG0_FRAMETYPE_Pos)                /*!< 0x00000002UL*/
#define DMA_DMA_BUILDCFG0_FRAMETYPE_2               (0x4UL << DMA_DMA_BUILDCFG0_FRAMETYPE_Pos)                /*!< 0x00000004UL*/
#define DMA_DMA_BUILDCFG0_NUM_CHANNELS_Pos          (4U)
#define DMA_DMA_BUILDCFG0_NUM_CHANNELS_Msk          (0x3FUL << DMA_DMA_BUILDCFG0_NUM_CHANNELS_Pos)            /*!< 0x000003F0UL*/
#define DMA_DMA_BUILDCFG0_NUM_CHANNELS              DMA_DMA_BUILDCFG0_NUM_CHANNELS_Msk                        /*!< NUM_CHANNELS[ 5:0] bits Number of Channels + 1 supported by the DMAC*/
#define DMA_DMA_BUILDCFG0_NUM_CHANNELS_0            (0x1UL << DMA_DMA_BUILDCFG0_NUM_CHANNELS_Pos)             /*!< 0x00000010UL*/
#define DMA_DMA_BUILDCFG0_NUM_CHANNELS_1            (0x2UL << DMA_DMA_BUILDCFG0_NUM_CHANNELS_Pos)             /*!< 0x00000020UL*/
#define DMA_DMA_BUILDCFG0_NUM_CHANNELS_2            (0x4UL << DMA_DMA_BUILDCFG0_NUM_CHANNELS_Pos)             /*!< 0x00000040UL*/
#define DMA_DMA_BUILDCFG0_NUM_CHANNELS_3            (0x8UL << DMA_DMA_BUILDCFG0_NUM_CHANNELS_Pos)             /*!< 0x00000080UL*/
#define DMA_DMA_BUILDCFG0_NUM_CHANNELS_4            (0x10UL << DMA_DMA_BUILDCFG0_NUM_CHANNELS_Pos)            /*!< 0x00000100UL*/
#define DMA_DMA_BUILDCFG0_NUM_CHANNELS_5            (0x20UL << DMA_DMA_BUILDCFG0_NUM_CHANNELS_Pos)            /*!< 0x00000200UL*/
#define DMA_DMA_BUILDCFG0_ADDR_WIDTH_Pos            (10U)
#define DMA_DMA_BUILDCFG0_ADDR_WIDTH_Msk            (0x3FUL << DMA_DMA_BUILDCFG0_ADDR_WIDTH_Pos)              /*!< 0x0000FC00UL*/
#define DMA_DMA_BUILDCFG0_ADDR_WIDTH                DMA_DMA_BUILDCFG0_ADDR_WIDTH_Msk                          /*!< ADDR_WIDTH[ 5:0] bits Address Width in bits = ADDR_WIDTH + 1*/
#define DMA_DMA_BUILDCFG0_ADDR_WIDTH_0              (0x1UL << DMA_DMA_BUILDCFG0_ADDR_WIDTH_Pos)               /*!< 0x00000400UL*/
#define DMA_DMA_BUILDCFG0_ADDR_WIDTH_1              (0x2UL << DMA_DMA_BUILDCFG0_ADDR_WIDTH_Pos)               /*!< 0x00000800UL*/
#define DMA_DMA_BUILDCFG0_ADDR_WIDTH_2              (0x4UL << DMA_DMA_BUILDCFG0_ADDR_WIDTH_Pos)               /*!< 0x00001000UL*/
#define DMA_DMA_BUILDCFG0_ADDR_WIDTH_3              (0x8UL << DMA_DMA_BUILDCFG0_ADDR_WIDTH_Pos)               /*!< 0x00002000UL*/
#define DMA_DMA_BUILDCFG0_ADDR_WIDTH_4              (0x10UL << DMA_DMA_BUILDCFG0_ADDR_WIDTH_Pos)              /*!< 0x00004000UL*/
#define DMA_DMA_BUILDCFG0_ADDR_WIDTH_5              (0x20UL << DMA_DMA_BUILDCFG0_ADDR_WIDTH_Pos)              /*!< 0x00008000UL*/
#define DMA_DMA_BUILDCFG0_DATA_WIDTH_Pos            (16U)
#define DMA_DMA_BUILDCFG0_DATA_WIDTH_Msk            (0x7UL << DMA_DMA_BUILDCFG0_DATA_WIDTH_Pos)               /*!< 0x00070000UL*/
#define DMA_DMA_BUILDCFG0_DATA_WIDTH                DMA_DMA_BUILDCFG0_DATA_WIDTH_Msk                          /*!< DATA_WIDTH[ 2:0] bits Data Width.
 - 000: 8-bit
 - 001: 16-bit
 - 010: 32-bit
 - 011: 64-bit
 - 100: 128-bit
 - 101: 256-bit
 - 110: 512-bit
 - 111: 1024-bit*/
#define DMA_DMA_BUILDCFG0_DATA_WIDTH_0              (0x1UL << DMA_DMA_BUILDCFG0_DATA_WIDTH_Pos)               /*!< 0x00010000UL*/
#define DMA_DMA_BUILDCFG0_DATA_WIDTH_1              (0x2UL << DMA_DMA_BUILDCFG0_DATA_WIDTH_Pos)               /*!< 0x00020000UL*/
#define DMA_DMA_BUILDCFG0_DATA_WIDTH_2              (0x4UL << DMA_DMA_BUILDCFG0_DATA_WIDTH_Pos)               /*!< 0x00040000UL*/
#define DMA_DMA_BUILDCFG0_CHID_WIDTH_Pos            (20U)
#define DMA_DMA_BUILDCFG0_CHID_WIDTH_Msk            (0x1FUL << DMA_DMA_BUILDCFG0_CHID_WIDTH_Pos)              /*!< 0x01F00000UL*/
#define DMA_DMA_BUILDCFG0_CHID_WIDTH                DMA_DMA_BUILDCFG0_CHID_WIDTH_Msk                          /*!< CHID_WIDTH[ 4:0] bits Channel ID Width. '0' means CHID is not present.*/
#define DMA_DMA_BUILDCFG0_CHID_WIDTH_0              (0x1UL << DMA_DMA_BUILDCFG0_CHID_WIDTH_Pos)               /*!< 0x00100000UL*/
#define DMA_DMA_BUILDCFG0_CHID_WIDTH_1              (0x2UL << DMA_DMA_BUILDCFG0_CHID_WIDTH_Pos)               /*!< 0x00200000UL*/
#define DMA_DMA_BUILDCFG0_CHID_WIDTH_2              (0x4UL << DMA_DMA_BUILDCFG0_CHID_WIDTH_Pos)               /*!< 0x00400000UL*/
#define DMA_DMA_BUILDCFG0_CHID_WIDTH_3              (0x8UL << DMA_DMA_BUILDCFG0_CHID_WIDTH_Pos)               /*!< 0x00800000UL*/
#define DMA_DMA_BUILDCFG0_CHID_WIDTH_4              (0x10UL << DMA_DMA_BUILDCFG0_CHID_WIDTH_Pos)              /*!< 0x01000000UL*/
/***************  Field definitions for DMA_BUILDCFG1 register  ***************/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos        (0U)
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Msk        (0x1FFUL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos)         /*!< 0x000001FFUL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN            DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Msk                      /*!< NUM_TRIGGER_IN[ 8:0] bits Number of  Triggers Inputs. '0' means that no input triggers are present.*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_0          (0x1UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos)           /*!< 0x00000001UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_1          (0x2UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos)           /*!< 0x00000002UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_2          (0x4UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos)           /*!< 0x00000004UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_3          (0x8UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos)           /*!< 0x00000008UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_4          (0x10UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos)          /*!< 0x00000010UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_5          (0x20UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos)          /*!< 0x00000020UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_6          (0x40UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos)          /*!< 0x00000040UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_7          (0x80UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos)          /*!< 0x00000080UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_8          (0x100UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_IN_Pos)         /*!< 0x00000100UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Pos       (9U)
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Msk       (0x7FUL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Pos)         /*!< 0x0000FE00UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT           DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Msk                     /*!< NUM_TRIGGER_OUT[ 6:0] bits Number of  Triggers Outputs. '0' means that no output triggers are present.*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_0         (0x1UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Pos)          /*!< 0x00000200UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_1         (0x2UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Pos)          /*!< 0x00000400UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_2         (0x4UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Pos)          /*!< 0x00000800UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_3         (0x8UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Pos)          /*!< 0x00001000UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_4         (0x10UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Pos)         /*!< 0x00002000UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_5         (0x20UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Pos)         /*!< 0x00004000UL*/
#define DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_6         (0x40UL << DMA_DMA_BUILDCFG1_NUM_TRIGGER_OUT_Pos)         /*!< 0x00008000UL*/
#define DMA_DMA_BUILDCFG1_HAS_TRIGSEL_Pos           (16U)
#define DMA_DMA_BUILDCFG1_HAS_TRIGSEL_Msk           (0x1UL << DMA_DMA_BUILDCFG1_HAS_TRIGSEL_Pos)              /*!< 0x00010000UL*/
#define DMA_DMA_BUILDCFG1_HAS_TRIGSEL               DMA_DMA_BUILDCFG1_HAS_TRIGSEL_Msk                         /*!< HAS_TRIGSEL bit Has Selectable Trigger Support*/
/***************  Field definitions for DMA_BUILDCFG2 register  ***************/
#define DMA_DMA_BUILDCFG2_HAS_GPOSEL_Pos            (7U)
#define DMA_DMA_BUILDCFG2_HAS_GPOSEL_Msk            (0x1UL << DMA_DMA_BUILDCFG2_HAS_GPOSEL_Pos)               /*!< 0x00000080UL*/
#define DMA_DMA_BUILDCFG2_HAS_GPOSEL                DMA_DMA_BUILDCFG2_HAS_GPOSEL_Msk                          /*!< HAS_GPOSEL bit Has Shared and hence Selectable GPO Support.*/
#define DMA_DMA_BUILDCFG2_HAS_TZ_Pos                (8U)
#define DMA_DMA_BUILDCFG2_HAS_TZ_Msk                (0x1UL << DMA_DMA_BUILDCFG2_HAS_TZ_Pos)                   /*!< 0x00000100UL*/
#define DMA_DMA_BUILDCFG2_HAS_TZ                    DMA_DMA_BUILDCFG2_HAS_TZ_Msk                              /*!< HAS_TZ bit Has TrustZone Support*/
#define DMA_DMA_BUILDCFG2_HAS_RET_Pos               (9U)
#define DMA_DMA_BUILDCFG2_HAS_RET_Msk               (0x1UL << DMA_DMA_BUILDCFG2_HAS_RET_Pos)                  /*!< 0x00000200UL*/
#define DMA_DMA_BUILDCFG2_HAS_RET                   DMA_DMA_BUILDCFG2_HAS_RET_Msk                             /*!< HAS_RET bit Has Retention Support*/
/*******************  Field definitions for IIDR register  ********************/
#define DMA_IIDR_IMPLEMENTER_Pos                    (0U)
#define DMA_IIDR_IMPLEMENTER_Msk                    (0xFFFUL << DMA_IIDR_IMPLEMENTER_Pos)                     /*!< 0x00000FFFUL*/
#define DMA_IIDR_IMPLEMENTER                        DMA_IIDR_IMPLEMENTER_Msk                                  /*!< IMPLEMENTER[11:0] bits Contains the JEP106 code of the company that implemented the IP:
 - [11:8]: JEP106 continuation code of implementer.
 - [7]: Always 0.
 - [6:0]: JEP106 identity code of implementer.
For Arm this field reads as 0x43B.*/
#define DMA_IIDR_IMPLEMENTER_0                      (0x1UL << DMA_IIDR_IMPLEMENTER_Pos)                       /*!< 0x00000001UL*/
#define DMA_IIDR_IMPLEMENTER_1                      (0x2UL << DMA_IIDR_IMPLEMENTER_Pos)                       /*!< 0x00000002UL*/
#define DMA_IIDR_IMPLEMENTER_2                      (0x4UL << DMA_IIDR_IMPLEMENTER_Pos)                       /*!< 0x00000004UL*/
#define DMA_IIDR_IMPLEMENTER_3                      (0x8UL << DMA_IIDR_IMPLEMENTER_Pos)                       /*!< 0x00000008UL*/
#define DMA_IIDR_IMPLEMENTER_4                      (0x10UL << DMA_IIDR_IMPLEMENTER_Pos)                      /*!< 0x00000010UL*/
#define DMA_IIDR_IMPLEMENTER_5                      (0x20UL << DMA_IIDR_IMPLEMENTER_Pos)                      /*!< 0x00000020UL*/
#define DMA_IIDR_IMPLEMENTER_6                      (0x40UL << DMA_IIDR_IMPLEMENTER_Pos)                      /*!< 0x00000040UL*/
#define DMA_IIDR_IMPLEMENTER_7                      (0x80UL << DMA_IIDR_IMPLEMENTER_Pos)                      /*!< 0x00000080UL*/
#define DMA_IIDR_IMPLEMENTER_8                      (0x100UL << DMA_IIDR_IMPLEMENTER_Pos)                     /*!< 0x00000100UL*/
#define DMA_IIDR_IMPLEMENTER_9                      (0x200UL << DMA_IIDR_IMPLEMENTER_Pos)                     /*!< 0x00000200UL*/
#define DMA_IIDR_IMPLEMENTER_10                     (0x400UL << DMA_IIDR_IMPLEMENTER_Pos)                     /*!< 0x00000400UL*/
#define DMA_IIDR_IMPLEMENTER_11                     (0x800UL << DMA_IIDR_IMPLEMENTER_Pos)                     /*!< 0x00000800UL*/
#define DMA_IIDR_REVISION_Pos                       (12U)
#define DMA_IIDR_REVISION_Msk                       (0xFUL << DMA_IIDR_REVISION_Pos)                          /*!< 0x0000F000UL*/
#define DMA_IIDR_REVISION                           DMA_IIDR_REVISION_Msk                                     /*!< REVISION[ 3:0] bits Indicates the minor revision of the product rxpy identifier*/
#define DMA_IIDR_REVISION_0                         (0x1UL << DMA_IIDR_REVISION_Pos)                          /*!< 0x00001000UL*/
#define DMA_IIDR_REVISION_1                         (0x2UL << DMA_IIDR_REVISION_Pos)                          /*!< 0x00002000UL*/
#define DMA_IIDR_REVISION_2                         (0x4UL << DMA_IIDR_REVISION_Pos)                          /*!< 0x00004000UL*/
#define DMA_IIDR_REVISION_3                         (0x8UL << DMA_IIDR_REVISION_Pos)                          /*!< 0x00008000UL*/
#define DMA_IIDR_VARIANT_Pos                        (16U)
#define DMA_IIDR_VARIANT_Msk                        (0xFUL << DMA_IIDR_VARIANT_Pos)                           /*!< 0x000F0000UL*/
#define DMA_IIDR_VARIANT                            DMA_IIDR_VARIANT_Msk                                      /*!< VARIANT[ 3:0] bits Indicates the major revision, or variant, of the product rxpy identifier*/
#define DMA_IIDR_VARIANT_0                          (0x1UL << DMA_IIDR_VARIANT_Pos)                           /*!< 0x00010000UL*/
#define DMA_IIDR_VARIANT_1                          (0x2UL << DMA_IIDR_VARIANT_Pos)                           /*!< 0x00020000UL*/
#define DMA_IIDR_VARIANT_2                          (0x4UL << DMA_IIDR_VARIANT_Pos)                           /*!< 0x00040000UL*/
