zephyrproject-rtos/hal_nuvoton/m55m1x/StdDriver/inc/gdma/dma350_regdef.h
#define DMA_IIDR_VARIANT_3                          (0x8UL << DMA_IIDR_VARIANT_Pos)                           /*!< 0x00080000UL*/
#define DMA_IIDR_PRODUCTID_Pos                      (20U)
#define DMA_IIDR_PRODUCTID_Msk                      (0xFFFUL << DMA_IIDR_PRODUCTID_Pos)                       /*!< 0xFFF00000UL*/
#define DMA_IIDR_PRODUCTID                          DMA_IIDR_PRODUCTID_Msk                                    /*!< PRODUCTID[11:0] bits Indicates the product ID*/
#define DMA_IIDR_PRODUCTID_0                        (0x1UL << DMA_IIDR_PRODUCTID_Pos)                         /*!< 0x00100000UL*/
#define DMA_IIDR_PRODUCTID_1                        (0x2UL << DMA_IIDR_PRODUCTID_Pos)                         /*!< 0x00200000UL*/
#define DMA_IIDR_PRODUCTID_2                        (0x4UL << DMA_IIDR_PRODUCTID_Pos)                         /*!< 0x00400000UL*/
#define DMA_IIDR_PRODUCTID_3                        (0x8UL << DMA_IIDR_PRODUCTID_Pos)                         /*!< 0x00800000UL*/
#define DMA_IIDR_PRODUCTID_4                        (0x10UL << DMA_IIDR_PRODUCTID_Pos)                        /*!< 0x01000000UL*/
#define DMA_IIDR_PRODUCTID_5                        (0x20UL << DMA_IIDR_PRODUCTID_Pos)                        /*!< 0x02000000UL*/
#define DMA_IIDR_PRODUCTID_6                        (0x40UL << DMA_IIDR_PRODUCTID_Pos)                        /*!< 0x04000000UL*/
#define DMA_IIDR_PRODUCTID_7                        (0x80UL << DMA_IIDR_PRODUCTID_Pos)                        /*!< 0x08000000UL*/
#define DMA_IIDR_PRODUCTID_8                        (0x100UL << DMA_IIDR_PRODUCTID_Pos)                       /*!< 0x10000000UL*/
#define DMA_IIDR_PRODUCTID_9                        (0x200UL << DMA_IIDR_PRODUCTID_Pos)                       /*!< 0x20000000UL*/
#define DMA_IIDR_PRODUCTID_10                       (0x400UL << DMA_IIDR_PRODUCTID_Pos)                       /*!< 0x40000000UL*/
#define DMA_IIDR_PRODUCTID_11                       (0x800UL << DMA_IIDR_PRODUCTID_Pos)                       /*!< 0x80000000UL*/
/*******************  Field definitions for AIDR register  ********************/
#define DMA_AIDR_ARCH_MINOR_REV_Pos                 (0U)
#define DMA_AIDR_ARCH_MINOR_REV_Msk                 (0xFUL << DMA_AIDR_ARCH_MINOR_REV_Pos)                    /*!< 0x0000000FUL*/
#define DMA_AIDR_ARCH_MINOR_REV                     DMA_AIDR_ARCH_MINOR_REV_Msk                               /*!< ARCH_MINOR_REV[ 3:0] bits Architecture Minor Revision.*/
#define DMA_AIDR_ARCH_MINOR_REV_0                   (0x1UL << DMA_AIDR_ARCH_MINOR_REV_Pos)                    /*!< 0x00000001UL*/
#define DMA_AIDR_ARCH_MINOR_REV_1                   (0x2UL << DMA_AIDR_ARCH_MINOR_REV_Pos)                    /*!< 0x00000002UL*/
#define DMA_AIDR_ARCH_MINOR_REV_2                   (0x4UL << DMA_AIDR_ARCH_MINOR_REV_Pos)                    /*!< 0x00000004UL*/
#define DMA_AIDR_ARCH_MINOR_REV_3                   (0x8UL << DMA_AIDR_ARCH_MINOR_REV_Pos)                    /*!< 0x00000008UL*/
#define DMA_AIDR_ARCH_MAJOR_REV_Pos                 (4U)
#define DMA_AIDR_ARCH_MAJOR_REV_Msk                 (0xFUL << DMA_AIDR_ARCH_MAJOR_REV_Pos)                    /*!< 0x000000F0UL*/
#define DMA_AIDR_ARCH_MAJOR_REV                     DMA_AIDR_ARCH_MAJOR_REV_Msk                               /*!< ARCH_MAJOR_REV[ 3:0] bits Architecture Major Revision.*/
#define DMA_AIDR_ARCH_MAJOR_REV_0                   (0x1UL << DMA_AIDR_ARCH_MAJOR_REV_Pos)                    /*!< 0x00000010UL*/
#define DMA_AIDR_ARCH_MAJOR_REV_1                   (0x2UL << DMA_AIDR_ARCH_MAJOR_REV_Pos)                    /*!< 0x00000020UL*/
#define DMA_AIDR_ARCH_MAJOR_REV_2                   (0x4UL << DMA_AIDR_ARCH_MAJOR_REV_Pos)                    /*!< 0x00000040UL*/
#define DMA_AIDR_ARCH_MAJOR_REV_3                   (0x8UL << DMA_AIDR_ARCH_MAJOR_REV_Pos)                    /*!< 0x00000080UL*/
/*******************  Field definitions for PIDR4 register  *******************/
#define DMA_PIDR4_DES_2_Pos                         (0U)
#define DMA_PIDR4_DES_2_Msk                         (0xFUL << DMA_PIDR4_DES_2_Pos)                            /*!< 0x0000000FUL*/
#define DMA_PIDR4_DES_2                             DMA_PIDR4_DES_2_Msk                                       /*!< DES_2[ 3:0] bits JEP106 Continuation Code*/
#define DMA_PIDR4_DES_2_0                           (0x1UL << DMA_PIDR4_DES_2_Pos)                            /*!< 0x00000001UL*/
#define DMA_PIDR4_DES_2_1                           (0x2UL << DMA_PIDR4_DES_2_Pos)                            /*!< 0x00000002UL*/
#define DMA_PIDR4_DES_2_2                           (0x4UL << DMA_PIDR4_DES_2_Pos)                            /*!< 0x00000004UL*/
#define DMA_PIDR4_DES_2_3                           (0x8UL << DMA_PIDR4_DES_2_Pos)                            /*!< 0x00000008UL*/
#define DMA_PIDR4_SIZE_Pos                          (4U)
#define DMA_PIDR4_SIZE_Msk                          (0xFUL << DMA_PIDR4_SIZE_Pos)                             /*!< 0x000000F0UL*/
#define DMA_PIDR4_SIZE                              DMA_PIDR4_SIZE_Msk                                        /*!< SIZE[ 3:0] bits 4KB Count - the number of 4K pages used.
 - 0x00: 4K
 - 0x01: 8K
 - 0x02: 16K
 - 0x03: 32K*/
#define DMA_PIDR4_SIZE_0                            (0x1UL << DMA_PIDR4_SIZE_Pos)                             /*!< 0x00000010UL*/
#define DMA_PIDR4_SIZE_1                            (0x2UL << DMA_PIDR4_SIZE_Pos)                             /*!< 0x00000020UL*/
#define DMA_PIDR4_SIZE_2                            (0x4UL << DMA_PIDR4_SIZE_Pos)                             /*!< 0x00000040UL*/
#define DMA_PIDR4_SIZE_3                            (0x8UL << DMA_PIDR4_SIZE_Pos)                             /*!< 0x00000080UL*/
/*******************  Field definitions for PIDR0 register  *******************/
#define DMA_PIDR0_PART_0_Pos                        (0U)
#define DMA_PIDR0_PART_0_Msk                        (0xFFUL << DMA_PIDR0_PART_0_Pos)                          /*!< 0x000000FFUL*/
#define DMA_PIDR0_PART_0                            DMA_PIDR0_PART_0_Msk                                      /*!< PART_0[ 7:0] bits Part Number [7:0]*/
#define DMA_PIDR0_PART_0_0                          (0x1UL << DMA_PIDR0_PART_0_Pos)                           /*!< 0x00000001UL*/
#define DMA_PIDR0_PART_0_1                          (0x2UL << DMA_PIDR0_PART_0_Pos)                           /*!< 0x00000002UL*/
#define DMA_PIDR0_PART_0_2                          (0x4UL << DMA_PIDR0_PART_0_Pos)                           /*!< 0x00000004UL*/
#define DMA_PIDR0_PART_0_3                          (0x8UL << DMA_PIDR0_PART_0_Pos)                           /*!< 0x00000008UL*/
#define DMA_PIDR0_PART_0_4                          (0x10UL << DMA_PIDR0_PART_0_Pos)                          /*!< 0x00000010UL*/
#define DMA_PIDR0_PART_0_5                          (0x20UL << DMA_PIDR0_PART_0_Pos)                          /*!< 0x00000020UL*/
#define DMA_PIDR0_PART_0_6                          (0x40UL << DMA_PIDR0_PART_0_Pos)                          /*!< 0x00000040UL*/
#define DMA_PIDR0_PART_0_7                          (0x80UL << DMA_PIDR0_PART_0_Pos)                          /*!< 0x00000080UL*/
/*******************  Field definitions for PIDR1 register  *******************/
#define DMA_PIDR1_PART_1_Pos                        (0U)
#define DMA_PIDR1_PART_1_Msk                        (0xFUL << DMA_PIDR1_PART_1_Pos)                           /*!< 0x0000000FUL*/
#define DMA_PIDR1_PART_1                            DMA_PIDR1_PART_1_Msk                                      /*!< PART_1[ 3:0] bits Part Number [11:8].*/
#define DMA_PIDR1_PART_1_0                          (0x1UL << DMA_PIDR1_PART_1_Pos)                           /*!< 0x00000001UL*/
#define DMA_PIDR1_PART_1_1                          (0x2UL << DMA_PIDR1_PART_1_Pos)                           /*!< 0x00000002UL*/
#define DMA_PIDR1_PART_1_2                          (0x4UL << DMA_PIDR1_PART_1_Pos)                           /*!< 0x00000004UL*/
#define DMA_PIDR1_PART_1_3                          (0x8UL << DMA_PIDR1_PART_1_Pos)                           /*!< 0x00000008UL*/
#define DMA_PIDR1_DES_0_Pos                         (4U)
#define DMA_PIDR1_DES_0_Msk                         (0xFUL << DMA_PIDR1_DES_0_Pos)                            /*!< 0x000000F0UL*/
#define DMA_PIDR1_DES_0                             DMA_PIDR1_DES_0_Msk                                       /*!< DES_0[ 3:0] bits JEP106 Identity Code [3:0]*/
#define DMA_PIDR1_DES_0_0                           (0x1UL << DMA_PIDR1_DES_0_Pos)                            /*!< 0x00000010UL*/
#define DMA_PIDR1_DES_0_1                           (0x2UL << DMA_PIDR1_DES_0_Pos)                            /*!< 0x00000020UL*/
#define DMA_PIDR1_DES_0_2                           (0x4UL << DMA_PIDR1_DES_0_Pos)                            /*!< 0x00000040UL*/
#define DMA_PIDR1_DES_0_3                           (0x8UL << DMA_PIDR1_DES_0_Pos)                            /*!< 0x00000080UL*/
/*******************  Field definitions for PIDR2 register  *******************/
#define DMA_PIDR2_DES_1_Pos                         (0U)
#define DMA_PIDR2_DES_1_Msk                         (0x7UL << DMA_PIDR2_DES_1_Pos)                            /*!< 0x00000007UL*/
#define DMA_PIDR2_DES_1                             DMA_PIDR2_DES_1_Msk                                       /*!< DES_1[ 2:0] bits JEP106 Identity Code [6:4]*/
#define DMA_PIDR2_DES_1_0                           (0x1UL << DMA_PIDR2_DES_1_Pos)                            /*!< 0x00000001UL*/
#define DMA_PIDR2_DES_1_1                           (0x2UL << DMA_PIDR2_DES_1_Pos)                            /*!< 0x00000002UL*/
#define DMA_PIDR2_DES_1_2                           (0x4UL << DMA_PIDR2_DES_1_Pos)                            /*!< 0x00000004UL*/
#define DMA_PIDR2_JEDEC_Pos                         (3U)
#define DMA_PIDR2_JEDEC_Msk                         (0x1UL << DMA_PIDR2_JEDEC_Pos)                            /*!< 0x00000008UL*/
#define DMA_PIDR2_JEDEC                             DMA_PIDR2_JEDEC_Msk                                       /*!< JEDEC bit JEDEC*/
#define DMA_PIDR2_REVISION_Pos                      (4U)
#define DMA_PIDR2_REVISION_Msk                      (0xFUL << DMA_PIDR2_REVISION_Pos)                         /*!< 0x000000F0UL*/
#define DMA_PIDR2_REVISION                          DMA_PIDR2_REVISION_Msk                                    /*!< REVISION[ 3:0] bits Revision Code*/
#define DMA_PIDR2_REVISION_0                        (0x1UL << DMA_PIDR2_REVISION_Pos)                         /*!< 0x00000010UL*/
#define DMA_PIDR2_REVISION_1                        (0x2UL << DMA_PIDR2_REVISION_Pos)                         /*!< 0x00000020UL*/
#define DMA_PIDR2_REVISION_2                        (0x4UL << DMA_PIDR2_REVISION_Pos)                         /*!< 0x00000040UL*/
#define DMA_PIDR2_REVISION_3                        (0x8UL << DMA_PIDR2_REVISION_Pos)                         /*!< 0x00000080UL*/
/*******************  Field definitions for PIDR3 register  *******************/
#define DMA_PIDR3_CMOD_Pos                          (0U)
#define DMA_PIDR3_CMOD_Msk                          (0xFUL << DMA_PIDR3_CMOD_Pos)                             /*!< 0x0000000FUL*/
#define DMA_PIDR3_CMOD                              DMA_PIDR3_CMOD_Msk                                        /*!< CMOD[ 3:0] bits Customer Modified*/
#define DMA_PIDR3_CMOD_0                            (0x1UL << DMA_PIDR3_CMOD_Pos)                             /*!< 0x00000001UL*/
#define DMA_PIDR3_CMOD_1                            (0x2UL << DMA_PIDR3_CMOD_Pos)                             /*!< 0x00000002UL*/
#define DMA_PIDR3_CMOD_2                            (0x4UL << DMA_PIDR3_CMOD_Pos)                             /*!< 0x00000004UL*/
#define DMA_PIDR3_CMOD_3                            (0x8UL << DMA_PIDR3_CMOD_Pos)                             /*!< 0x00000008UL*/
#define DMA_PIDR3_REVAND_Pos                        (4U)
#define DMA_PIDR3_REVAND_Msk                        (0xFUL << DMA_PIDR3_REVAND_Pos)                           /*!< 0x000000F0UL*/
#define DMA_PIDR3_REVAND                            DMA_PIDR3_REVAND_Msk                                      /*!< REVAND[ 3:0] bits Manufacturer revision number*/
#define DMA_PIDR3_REVAND_0                          (0x1UL << DMA_PIDR3_REVAND_Pos)                           /*!< 0x00000010UL*/
#define DMA_PIDR3_REVAND_1                          (0x2UL << DMA_PIDR3_REVAND_Pos)                           /*!< 0x00000020UL*/
#define DMA_PIDR3_REVAND_2                          (0x4UL << DMA_PIDR3_REVAND_Pos)                           /*!< 0x00000040UL*/
#define DMA_PIDR3_REVAND_3                          (0x8UL << DMA_PIDR3_REVAND_Pos)                           /*!< 0x00000080UL*/
/*******************  Field definitions for CIDR0 register  *******************/
#define DMA_CIDR0_PRMBL_0_Pos                       (0U)
#define DMA_CIDR0_PRMBL_0_Msk                       (0xFFUL << DMA_CIDR0_PRMBL_0_Pos)                         /*!< 0x000000FFUL*/
#define DMA_CIDR0_PRMBL_0                           DMA_CIDR0_PRMBL_0_Msk                                     /*!< PRMBL_0[ 7:0] bits Preamble*/
#define DMA_CIDR0_PRMBL_0_0                         (0x1UL << DMA_CIDR0_PRMBL_0_Pos)                          /*!< 0x00000001UL*/
#define DMA_CIDR0_PRMBL_0_1                         (0x2UL << DMA_CIDR0_PRMBL_0_Pos)                          /*!< 0x00000002UL*/
#define DMA_CIDR0_PRMBL_0_2                         (0x4UL << DMA_CIDR0_PRMBL_0_Pos)                          /*!< 0x00000004UL*/
#define DMA_CIDR0_PRMBL_0_3                         (0x8UL << DMA_CIDR0_PRMBL_0_Pos)                          /*!< 0x00000008UL*/
#define DMA_CIDR0_PRMBL_0_4                         (0x10UL << DMA_CIDR0_PRMBL_0_Pos)                         /*!< 0x00000010UL*/
#define DMA_CIDR0_PRMBL_0_5                         (0x20UL << DMA_CIDR0_PRMBL_0_Pos)                         /*!< 0x00000020UL*/
#define DMA_CIDR0_PRMBL_0_6                         (0x40UL << DMA_CIDR0_PRMBL_0_Pos)                         /*!< 0x00000040UL*/
#define DMA_CIDR0_PRMBL_0_7                         (0x80UL << DMA_CIDR0_PRMBL_0_Pos)                         /*!< 0x00000080UL*/
/*******************  Field definitions for CIDR1 register  *******************/
#define DMA_CIDR1_PRMBL_1_Pos                       (0U)
#define DMA_CIDR1_PRMBL_1_Msk                       (0xFUL << DMA_CIDR1_PRMBL_1_Pos)                          /*!< 0x0000000FUL*/
#define DMA_CIDR1_PRMBL_1                           DMA_CIDR1_PRMBL_1_Msk                                     /*!< PRMBL_1[ 3:0] bits Preamble*/
#define DMA_CIDR1_PRMBL_1_0                         (0x1UL << DMA_CIDR1_PRMBL_1_Pos)                          /*!< 0x00000001UL*/
#define DMA_CIDR1_PRMBL_1_1                         (0x2UL << DMA_CIDR1_PRMBL_1_Pos)                          /*!< 0x00000002UL*/
#define DMA_CIDR1_PRMBL_1_2                         (0x4UL << DMA_CIDR1_PRMBL_1_Pos)                          /*!< 0x00000004UL*/
#define DMA_CIDR1_PRMBL_1_3                         (0x8UL << DMA_CIDR1_PRMBL_1_Pos)                          /*!< 0x00000008UL*/
#define DMA_CIDR1_CLASS_Pos                         (4U)
#define DMA_CIDR1_CLASS_Msk                         (0xFUL << DMA_CIDR1_CLASS_Pos)                            /*!< 0x000000F0UL*/
#define DMA_CIDR1_CLASS                             DMA_CIDR1_CLASS_Msk                                       /*!< CLASS[ 3:0] bits Component class*/
#define DMA_CIDR1_CLASS_0                           (0x1UL << DMA_CIDR1_CLASS_Pos)                            /*!< 0x00000010UL*/
#define DMA_CIDR1_CLASS_1                           (0x2UL << DMA_CIDR1_CLASS_Pos)                            /*!< 0x00000020UL*/
#define DMA_CIDR1_CLASS_2                           (0x4UL << DMA_CIDR1_CLASS_Pos)                            /*!< 0x00000040UL*/
#define DMA_CIDR1_CLASS_3                           (0x8UL << DMA_CIDR1_CLASS_Pos)                            /*!< 0x00000080UL*/
/*******************  Field definitions for CIDR2 register  *******************/
#define DMA_CIDR2_PRMBL_2_Pos                       (0U)
#define DMA_CIDR2_PRMBL_2_Msk                       (0xFFUL << DMA_CIDR2_PRMBL_2_Pos)                         /*!< 0x000000FFUL*/
#define DMA_CIDR2_PRMBL_2                           DMA_CIDR2_PRMBL_2_Msk                                     /*!< PRMBL_2[ 7:0] bits Preamble*/
#define DMA_CIDR2_PRMBL_2_0                         (0x1UL << DMA_CIDR2_PRMBL_2_Pos)                          /*!< 0x00000001UL*/
#define DMA_CIDR2_PRMBL_2_1                         (0x2UL << DMA_CIDR2_PRMBL_2_Pos)                          /*!< 0x00000002UL*/
#define DMA_CIDR2_PRMBL_2_2                         (0x4UL << DMA_CIDR2_PRMBL_2_Pos)                          /*!< 0x00000004UL*/
#define DMA_CIDR2_PRMBL_2_3                         (0x8UL << DMA_CIDR2_PRMBL_2_Pos)                          /*!< 0x00000008UL*/
#define DMA_CIDR2_PRMBL_2_4                         (0x10UL << DMA_CIDR2_PRMBL_2_Pos)                         /*!< 0x00000010UL*/
#define DMA_CIDR2_PRMBL_2_5                         (0x20UL << DMA_CIDR2_PRMBL_2_Pos)                         /*!< 0x00000020UL*/
#define DMA_CIDR2_PRMBL_2_6                         (0x40UL << DMA_CIDR2_PRMBL_2_Pos)                         /*!< 0x00000040UL*/
#define DMA_CIDR2_PRMBL_2_7                         (0x80UL << DMA_CIDR2_PRMBL_2_Pos)                         /*!< 0x00000080UL*/
/*******************  Field definitions for CIDR3 register  *******************/
#define DMA_CIDR3_PRMBL_3_Pos                       (0U)
#define DMA_CIDR3_PRMBL_3_Msk                       (0xFFUL << DMA_CIDR3_PRMBL_3_Pos)                         /*!< 0x000000FFUL*/
#define DMA_CIDR3_PRMBL_3                           DMA_CIDR3_PRMBL_3_Msk                                     /*!< PRMBL_3[ 7:0] bits Preamble*/
#define DMA_CIDR3_PRMBL_3_0                         (0x1UL << DMA_CIDR3_PRMBL_3_Pos)                          /*!< 0x00000001UL*/
#define DMA_CIDR3_PRMBL_3_1                         (0x2UL << DMA_CIDR3_PRMBL_3_Pos)                          /*!< 0x00000002UL*/
#define DMA_CIDR3_PRMBL_3_2                         (0x4UL << DMA_CIDR3_PRMBL_3_Pos)                          /*!< 0x00000004UL*/
#define DMA_CIDR3_PRMBL_3_3                         (0x8UL << DMA_CIDR3_PRMBL_3_Pos)                          /*!< 0x00000008UL*/
#define DMA_CIDR3_PRMBL_3_4                         (0x10UL << DMA_CIDR3_PRMBL_3_Pos)                         /*!< 0x00000010UL*/
#define DMA_CIDR3_PRMBL_3_5                         (0x20UL << DMA_CIDR3_PRMBL_3_Pos)                         /*!< 0x00000020UL*/
#define DMA_CIDR3_PRMBL_3_6                         (0x40UL << DMA_CIDR3_PRMBL_3_Pos)                         /*!< 0x00000040UL*/
#define DMA_CIDR3_PRMBL_3_7                         (0x80UL << DMA_CIDR3_PRMBL_3_Pos)                         /*!< 0x00000080UL*/

#endif /* __DMA350_REGDEF_H */
